# Lab4 pandas

In [1]:
import pandas as pd

In [2]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks',
'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts',
'Scouts', 'Scouts', 'Scouts'],'company': ['1st', '1st', '2nd', '2nd',
'1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],'name': ['Miller',
'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan',
'Piger', 'Riani', 'Ali'],'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3,
2, 3],'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [3]:
df=pd.DataFrame(raw_data)

In [4]:
df

   company      name  postTestScore  preTestScore    regiment
0      1st    Miller             25             4  Nighthawks
1      1st  Jacobson             94            24  Nighthawks
2      2nd       Ali             57            31  Nighthawks
3      2nd    Milner             62             2  Nighthawks
4      1st     Cooze             70             3    Dragoons
5      1st     Jacon             25             4    Dragoons
6      2nd    Ryaner             94            24    Dragoons
7      2nd      Sone             57            31    Dragoons
8      1st     Sloan             62             2      Scouts
9      1st     Piger             70             3      Scouts
10     2nd     Riani             62             2      Scouts
11     2nd       Ali             70             3      Scouts

In [5]:
df_group_regiment=df.groupby('regiment')

In [6]:
df[df['regiment']=='Nighthawks']['preTestScore'].mean()

15.25

In [7]:
df_group_regiment.mean()['preTestScore']['Nighthawks']

15.25

In [8]:
df_group_company=df.groupby('company')

In [9]:
df_group_company.describe()

        postTestScore                                                       \
                count       mean        std   min    25%   50%   75%   max
company
1st               6.0  57.666667  27.485754  25.0  34.25  66.0  70.0  94.0
2nd               6.0  67.000000  14.057027  57.0  58.25  62.0  68.0  94.0

        preTestScore
               count       mean        std  min   25%   50%    75%   max
company
1st              6.0   6.666667   8.524475  2.0  3.00   3.5   4.00  24.0
2nd              6.0  15.500000  14.652645  2.0  2.25  13.5  29.25  31.0

In [10]:
df_group_company.mean()['preTestScore']

company
1st     6.666667
2nd    15.500000
Name: preTestScore, dtype: float64

In [38]:
for comp in df['company'].unique():
    for reg in df['regiment'].unique():
        print('company = {}, regiment = {} => mean TestScore = {} '.format(comp, reg,df[(df['regiment']==reg) & (df['company']==comp)]['preTestScore'].mean()))

company = 1st, regiment = Nighthawks => mean TestScore = 14.0
company = 1st, regiment = Dragoons => mean TestScore = 3.5
company = 1st, regiment = Scouts => mean TestScore = 2.5
company = 2nd, regiment = Nighthawks => mean TestScore = 16.5
company = 2nd, regiment = Dragoons => mean TestScore = 27.5
company = 2nd, regiment = Scouts => mean TestScore = 2.5

In [41]:
data=[]
for comp in df['company'].unique():
    for reg in df['regiment'].unique():
        data.append(df[(df['regiment']==reg) & (df['company']==comp)]['preTestScore'].mean())

In [42]:
df_group_company['regiment'].value_counts()

company  regiment
1st      Dragoons      2
         Nighthawks    2
         Scouts        2
2nd      Dragoons      2
         Nighthawks    2
         Scouts        2
Name: regiment, dtype: int64

In [54]:
outside=['1st', '1st', '1st', '2nd', '2nd', '2nd']
inside=['Nighthawks', 'Dragoons','Scouts ', 'Nighthawks', 'Dragoons','Scouts ']
hier_index=list(zip(outside, inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [56]:
new_df=pd.DataFrame(data, index=hier_index, columns=['mean preTestScore'])
new_df.index.names=["company", "regiment"]

In [57]:
new_df

                    mean preTestScore
company regiment
1st     Nighthawks               14.0
        Dragoons                  3.5
        Scouts                    2.5
2nd     Nighthawks               16.5
        Dragoons                 27.5
        Scouts                    2.5

In [52]:
df.groupby(['company', 'regiment']).mean()['preTestScore']

company  regiment
1st      Dragoons       3.5
         Nighthawks    14.0
         Scouts         2.5
2nd      Dragoons      27.5
         Nighthawks    16.5
         Scouts         2.5
Name: preTestScore, dtype: float64

In [58]:
df_group=df.groupby(['company', 'regiment'])

In [63]:
df_group['company'].value_counts()

company  regiment    company
1st      Dragoons    1st        2
         Nighthawks  1st        2
         Scouts      1st        2
2nd      Dragoons    2nd        2
         Nighthawks  2nd        2
         Scouts      2nd        2
Name: company, dtype: int64

In [64]:
df_group['regiment'].value_counts()

company  regiment    regiment
1st      Dragoons    Dragoons      2
         Nighthawks  Nighthawks    2
         Scouts      Scouts        2
2nd      Dragoons    Dragoons      2
         Nighthawks  Nighthawks    2
         Scouts      Scouts        2
Name: regiment, dtype: int64

In [75]:
df.pivot_table(values=['preTestScore','postTestScore'], index=['company', 'regiment'], columns=['name'])

                   postTestScore                                           \
name                         Ali Cooze Jacobson Jacon Miller Milner Piger
company regiment
1st     Dragoons             NaN  70.0      NaN  25.0    NaN    NaN   NaN
        Nighthawks           NaN   NaN     94.0   NaN   25.0    NaN   NaN
        Scouts               NaN   NaN      NaN   NaN    NaN    NaN  70.0
2nd     Dragoons             NaN   NaN      NaN   NaN    NaN    NaN   NaN
        Nighthawks          57.0   NaN      NaN   NaN    NaN   62.0   NaN
        Scouts              70.0   NaN      NaN   NaN    NaN    NaN   NaN

                                       ...  preTestScore                 \
name               Riani Ryaner Sloan  ...         Cooze Jacobson Jacon
company regiment                       ...
1st     Dragoons     NaN    NaN   NaN  ...           3.0      NaN   4.0
        Nighthawks   NaN    NaN   NaN  ...           NaN     24.0   NaN
        Scouts       NaN    NaN  62.0  ...           NaN      NaN   NaN
2nd     Dragoons     NaN   94.0   NaN  ...           NaN      NaN   NaN
        Nighthawks   NaN    NaN   NaN  ...           NaN      NaN   NaN
        Scouts      62.0    NaN   NaN  ...           NaN      NaN   NaN


name               Miller Milner Piger Riani Ryaner Sloan  Sone
company regiment
1st     Dragoons      NaN    NaN   NaN   NaN    NaN   NaN   NaN
        Nighthawks    4.0    NaN   NaN   NaN    NaN   NaN   NaN
        Scouts        NaN    NaN   3.0   NaN    NaN   2.0   NaN
2nd     Dragoons      NaN    NaN   NaN   NaN   24.0   NaN  31.0
        Nighthawks    NaN    2.0   NaN   NaN    NaN   NaN   NaN
        Scouts        NaN    NaN   NaN   2.0    NaN   NaN   NaN

[6 rows x 22 columns]